Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LappingTypeEnum Enumeration
 The lapping type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LappingTypeEnum
Public Enumeration LappingTypeEnum
Members
Member name | Value | Description
CUSTOM_LAPPING | 0 |  Custom lapping.
STANDARD_LAPPING | 1 |  Standard lapping.
See Also
Reference
Tekla.Structures.Model Namespace